R = []
R += [
    (239, "汉兵至，无奈我何。”即穿井数百，伐材数千", "〖◆汉〗兵至，无奈我何。”即穿井数百，伐材数千"),
    (239, "或曰胡人不能守城，是遗汉粮也，卫律于是止，乃更谋归汉使不降者苏武、马宏等", "或曰胡人不能守城，是遗〖◆汉〗粮也，〖@卫律〗于是止，乃更谋归〖◆汉〗使不降者〖@苏武〗、〖@马宏〗等"),
    (239, "马宏者，前副光禄大夫王忠使西国，为匈奴所遮，忠战死，马宏生得，亦不肯降", "〖@马宏〗者，前副光禄大夫〖@王忠〗使西国，为〖◆匈奴〗所遮，〖@王忠〗⟦◎战死〗，〖@马宏〗⟦◎生得〗，亦不肯降"),
    (239, "故匈奴归此二人，欲以通善意。是时，单于立三岁矣", "故〖◆匈奴〗归此二人，欲以通善意。是时，〖;单于〗立三岁矣"),
]
R += [
    (241, "明年，匈奴发左右部二万骑，为四队，并入边为寇。汉兵追之，斩首获虏九千人，生得瓯脱王，汉无所失亡", "明年，〖◆匈奴〗发左右部二万骑，为四队，并入边为寇。〖◆汉〗兵追之，斩首获虏九千人，⟦◎生得〗瓯脱王，〖◆汉〗无所失亡"),
    (241, "匈奴见瓯脱王在汉，恐以为道击之，即西北远去，不敢南逐水草，发人民屯瓯脱", "〖◆匈奴〗见瓯脱王在〖◆汉〗，恐以为道击之，即西北远去，不敢南逐水草，发人民屯瓯脱"),
    (241, "明年，复遣九千骑屯受降城以备汉，北桥余吾，令可度，以备奔走", "明年，复遣九千骑屯〖=受降城〗以备〖◆汉〗，北桥〖=余吾〗，令可度，以备奔走"),
]
R += [
    (243, "是时，卫律已死。卫律在时，常言和亲之利，匈奴不信，及死后，兵数困，国益贫", "是时，〖@卫律〗已死。〖@卫律〗在时，常言和亲之利，〖◆匈奴〗不信，及死后，兵数困，国益贫"),
    (243, "单于弟左谷蠡王思卫律言，欲和亲而恐汉不听，故不肯先言，常使左右风汉使者", "〖;单于〗弟〖;左谷蠡王〗思〖@卫律〗言，欲和亲而恐〖◆汉〗不听，故不肯先言，常使左右风〖◆汉〗使者"),
    (243, "然其侵盗益希，遇汉使愈厚，欲以渐致和亲，汉亦羁縻之。其后，左谷蠡王死", "然其侵盗益希，遇〖◆汉〗使愈厚，欲以渐致和亲，〖◆汉〗亦羁縻之。其后，〖;左谷蠡王〗死"),
]
R += [
    (245, "明年，单于使犁污王窥边，言酒泉、张掖兵益弱，出兵试击，冀可复得其地", "明年，〖;单于〗使〖;犁污王〗窥边，言〖=酒泉〗、〖=张掖〗兵益弱，出兵试击，冀可复得其地"),
    (245, "时汉先得降者，闻其计，天子诏边警备。后无几，右贤王、犁污王四千骑分三队", "时〖◆汉〗先得降者，闻其计，〖#天子〗诏边警备。后无几，〖;右贤王〗、〖;犁污王〗四千骑分三队"),
    (245, "入日勒、屋兰、番和。张掖太守、属国都尉发兵击，大破之，得脱者数百人", "入〖=日勒〗、〖=屋兰〗、〖=番和〗。〖=张掖〗太守、属国都尉发兵⟦◈击〗，大⟦◈破〗之，得脱者数百人"),
]
R += [
    (247, "属国千长义渠王骑士射杀犁污王，赐黄金二百斤，马二百匹，因封为犁污王", "属国千长义渠王骑士⟦◎射杀〗〖;犁污王〗，赐黄金二百斤，马二百匹，因封为〖;犁污王〗"),
    (247, "属国都尉郭忠封成安侯。自是后，匈奴不敢入张掖", "属国都尉〖@郭忠〗封成安侯。自是后，〖◆匈奴〗不敢入〖=张掖〗"),
    (247, "其明年，匈奴三千余骑入五原，略杀数千人，后数万骑南旁塞猎，行攻塞外亭障，略取吏民去", "其明年，〖◆匈奴〗三千余骑入〖=五原〗，略杀数千人，后数万骑南旁塞猎，行攻塞外亭障，略取吏民去"),
]
R += [
    (249, "是时，汉边郡烽火候望精明，匈奴为边寇者少利，希复犯塞", "是时，〖◆汉〗边郡烽火候望精明，〖◆匈奴〗为边寇者少利，希复犯塞"),
    (249, "汉复得匈奴降者，言乌桓尝发先单于冢，匈奴怨之，方发二万骑击乌桓", "〖◆汉〗复得〖◆匈奴〗降者，言〖~乌桓〗尝发先〖;单于〗冢，〖◆匈奴〗怨之，方发二万骑⟦◎击〗〖~乌桓〗"),
    (249, "大将军霍光欲发兵邀击之，以问护军都尉赵充国。充国以为：“乌桓间数犭已塞，今匈奴击之，于汉便", "大将军〖@霍光〗欲发兵邀击之，以问护军都尉〖@赵充国〗。〖@赵充国〗以为：“〖~乌桓〗间数犭已塞，今〖◆匈奴〗击之，于〖◆汉〗便"),
    (249, "又匈奴希寇盗，北边幸无事”", "又〖◆匈奴〗希寇盗，北边幸无事”"),
]
R += [
    (251, "蛮夷自相攻击，而发兵要之，招寇生事，非计也。光更问中郎将范明友，明友言可击", "蛮夷自相攻击，而发兵要之，招寇生事，非计也。〖@霍光〗更问〖;中郎将〗〖@范明友〗，〖@范明友〗言可击"),
    (251, "于是拜明友为度辽将军，将二万骑出辽东。匈奴闻汉兵至，引去", "于是拜〖@范明友〗为度辽将军，将二万骑出〖=辽东〗。〖◆匈奴〗闻〖◆汉〗兵至，引去"),
    (251, "初，光诫朋友：“兵不空出，即后匈奴，遂击乌桓”", "初，〖@霍光〗诫〖@范明友〗曰：“兵不空出，即后〖◆匈奴〗，遂⟦◎击〗〖~乌桓〗”"),
]
R += [
    (253, "乌桓时新中匈奴兵，明友既后匈奴，因乘乌桓敝，击之，斩首六千余级，获三王首，还，封为平陵侯", "〖~乌桓〗时新中〖◆匈奴〗兵，〖@范明友〗既后〖◆匈奴〗，因乘〖~乌桓〗敝，⟦◎击〗之，斩首六千余级，获三王首，还，封为平陵侯"),
    (253, "匈奴由是恐，不能出兵。即使使之乌孙，求欲得汉公主。击乌孙，取车延、恶师地", "〖◆匈奴〗由是恐，不能出兵。即使使之〖◆乌孙〗，求欲得〖◆汉〗公主。⟦◎击〗〖◆乌孙〗，取车延、恶师地"),
    (253, "乌孙公主上书，下公卿议救，未决", "〖◆乌孙〗公主上书，下〖#公卿〗议救，未决"),
]
R += [
    (255, "昭帝崩，宣帝即位，乌孙昆弥复上书言：“连为匈奴所侵削，昆弥愿发国半精兵人马五万匹，尽力击匈奴，唯天子出兵，哀救公主！”", "〖@昭帝|汉昭帝〗崩，〖@宣帝|汉宣帝〗⟦○即位〗，〖◆乌孙〗昆弥复上书言：“连为〖◆匈奴〗所侵削，昆弥愿发国半精兵人马五万匹，尽力⟦◈击〗〖◆匈奴〗，唯〖#天子〗出兵，哀救公主！”"),
    (255, "本始二年，汉大发关东轻锐士，选郡国吏三百石伉健习骑射者，皆从军", "本始二年，〖◆汉〗大发关东轻锐士，选郡国吏三百石伉健习骑射者，皆从军"),
]
R += [
    (257, "遣御史大夫田广明为祁连将军，四万余骑，出西河；度辽将军范明友三万余骑，出张掖", "遣〖;御史大夫〗〖@田广明〗为祁连将军，四万余骑，出〖=西河〗；度辽将军〖@范明友〗三万余骑，出〖=张掖〗"),
    (257, "前将军韩增三万余骑，出云中；后将军赵充国为蒲类将军，三万余骑，出酒泉", "前将军〖@韩增〗三万余骑，出〖=云中〗；后将军〖@赵充国〗为蒲类将军，三万余骑，出〖=酒泉〗"),
    (257, "云中太守田顺为虎牙将军，三万余骑，出五原：凡五将军，兵十余万骑，出塞各二千余里", "〖=云中〗太守〖@田顺〗为虎牙将军，三万余骑，出〖=五原〗：凡五将军，兵十余万骑，出塞各二千余里"),
]
R += [
    (259, "及校尉常惠使护发兵乌孙西域，昆弥自将翕侯以下五万余骑从西方入，与五将军兵凡二十余万众", "及〖;校尉〗〖@常惠〗使护发兵〖◆乌孙〗西域，昆弥自将翕侯以下五万余骑从西方入，与五将军兵凡二十余万众"),
    (259, "匈奴闻汉兵大出，老弱奔走，驱畜产远遁逃，是以五将少所得", "〖◆匈奴〗闻〖◆汉〗兵大出，老弱⟦◎奔走〗，驱畜产远遁逃，是以五将少所得"),
    (259, "度辽将军出塞千二百余里，至蒲离候水，斩首捕虏七百余级，卤获马、牛、羊万余", "度辽将军出塞千二百余里，至〖=蒲离候水〗，斩首捕虏七百余级，卤获马、牛、羊万余"),
]
R += [
    (261, "前将军出塞千二百余里，至乌员，斩首捕虏，至候山百余级，卤马、牛、羊二千余", "前将军出塞千二百余里，至〖=乌员〗，斩首捕虏，至〖=候山〗百余级，卤马、牛、羊二千余"),
    (261, "蒲类将军兵当与乌孙合击匈奴蒲类泽，乌孙先期至而去，汉兵不与相及", "蒲类将军兵当与〖◆乌孙〗合击〖◆匈奴〗〖=蒲类泽〗，〖◆乌孙〗先期至而去，〖◆汉〗兵不与相及"),
    (261, "蒲类将军出塞千八百余里，西去候山，斩首捕虏，得单于使者蒲阴王以下三百余级，卤马、牛、羊七千余", "蒲类将军出塞千八百余里，西去〖=候山〗，斩首捕虏，得〖;单于〗使者蒲阴王以下三百余级，卤马、牛、羊七千余"),
]
R += [
    (263, "闻虏已引去，皆不至期还。天子蒲其过，宽而不罪", "闻虏已引去，皆不至期还。〖#天子〗蒲其过，宽而不罪"),
    (263, "祁连将军出塞千六百里，至鸡秩山，斩首捕虏十九级，获牛、马、羊百余", "祁连将军出塞千六百里，至〖=鸡秩山〗，斩首捕虏十九级，获牛、马、羊百余"),
    (263, "逢汉使匈奴还者冉弘等，言鸡秩山西有虏众，祁连即戒弘，使言无虏，欲还兵", "逢〖◆汉〗使〖◆匈奴〗还者冉弘等，言〖=鸡秩山〗西有虏众，祁连即戒弘，使言无虏，欲还兵"),
    (263, "御史属公孙益寿谏，以为不可，祁连不听，遂引兵还", "〖;御史〗属公孙益寿谏，以为不可，祁连不听，遂引兵还"),
]
R += [
    (265, "虎牙将军出塞八百余里，至丹余吾水上，即止兵不进，斩首捕虏千九百余级，卤马、牛、羊七万余，引兵还", "虎牙将军出塞八百余里，至〖=丹余吾水〗上，即止兵不进，斩首捕虏千九百余级，卤马、牛、羊七万余，引兵还"),
    (265, "上以虎牙将军不至期，诈增卤获，而祁连知虏在前，逗留不进，皆下吏自杀", "〖#上〗以虎牙将军不至期，诈增卤获，而祁连知虏在前，逗留不进，皆下吏⟦◉自杀〗"),
    (265, "擢公孙益寿为侍御史", "擢公孙益寿为〖;侍御史〗"),
]
R += [
    (267, "校尉常惠与乌孙兵至右谷蠡庭，获单于父行及嫂、居次、名王、犁污都尉、千长、将以下三万九千余级", "〖;校尉〗〖@常惠〗与〖◆乌孙〗兵至〖;右谷蠡〗庭，获〖;单于〗父行及嫂、居次、名王、〖;犁污都尉〗、〖;千长〗、将以下三万九千余级"),
    (267, "虏马、牛、羊、驴、骡、橐驼七十余万。汉封惠为长罗侯", "虏马、牛、羊、驴、骡、橐驼七十余万。〖◆汉〗封〖@常惠〗为〖=长罗〗侯"),
    (267, "然匈奴民众死伤而去者，及畜产远移死亡不可胜数。于是匈奴遂衰耗，怨乌孙", "然〖◆匈奴〗民众死伤而去者，及畜产远移死亡不可胜数。于是〖◆匈奴〗遂衰耗，怨〖◆乌孙〗"),
]
R += [
    (269, "其冬，单于自将万骑击乌孙，颇得老弱，欲还。会天大雨雪，一日深丈余，人民畜产冻死，还者不能什一", "其冬，〖;单于〗自将万骑⟦◎击〗〖◆乌孙〗，颇得老弱，欲还。会天大雨雪，一日深丈余，人民畜产冻死，还者不能什一"),
    (269, "于是丁令乘弱攻其北，乌桓入其东，乌孙击其西。凡三国所杀数万级，马数万匹，牛、羊甚众", "于是〖~丁令〗乘弱⟦◎攻〗其北，〖~乌桓〗入其东，〖◆乌孙〗⟦◎击〗其西。凡三国所杀数万级，马数万匹，牛、羊甚众"),
]
R += [
    (271, "又重以饿死，人民死者什三，畜产什五，匈奴大虚弱，诸国羁属者皆瓦解，攻盗不能理", "又重以饿死，人民死者什三，畜产什五，〖◆匈奴〗大虚弱，诸国羁属者皆瓦解，攻盗不能理"),
    (271, "其冬，单于自将万骑击乌孙，颇得老弱，欲还", "其冬，〖;单于〗自将万骑⟦◎击〗〖◆乌孙〗，颇得老弱，欲还"),
]
R += [
    (273, "又乌桓乘弱击其东，丁令攻其北，乌孙击其西，三国共杀数万级，马牛羊更死，匈奴益弱", "又〖~乌桓〗乘弱⟦◎攻〗其东，〖~丁令〗⟦◎攻〗其北，〖◆乌孙〗⟦◎击〗其西，三国共杀数万级，马牛羊更死，〖◆匈奴〗益弱"),
    (273, "其明年，单于将兵击乌孙，多斩首虏，又西击乌桓，破之", "其明年，〖;单于〗将兵⟦◎击〗〖◆乌孙〗，多斩首虏，又西⟦◎击〗〖~乌桓〗，⟦◎破〗之"),
    (273, "乌孙亦乘虚攻其北，匈奴引去", "〖◆乌孙〗亦乘虚⟦◎攻〗其北，〖◆匈奴〗引去"),
]
R += [
    (275, "是岁，神爵二年也。单于遣弟朝贺。汉欲遣使送之，会病死，汉以无功不赏", "是岁，神爵二年也。〖;单于〗遣弟朝贺。〖◆汉〗欲遣使送之，会病死，〖◆汉〗以无功不赏"),
    (275, "其后，单于使来，辄留不归。居于北，自是后，匈奴寇盗益希", "其后，〖;单于〗使来，辄留不归。居于北，自是后，〖◆匈奴〗寇盗益希"),
]
R += [
    (277, "呼韩邪单于之归也，遣子右贤王铢娄渠堂入侍。后数岁，郅支单于亦遣子入侍", "〖@呼韩邪〗〖;单于〗之归也，遣子〖;右贤王〗〖@铢娄渠堂〗入侍。后数岁，〖@郅支〗〖;单于〗亦遣子入侍"),
    (277, "汉待其使未尝至。后郅支单于自以道远，又怨汉护呼韩邪而不助己，乃遣使求侍子", "〖◆汉〗待其使未尝至。后〖@郅支〗〖;单于〗自以道远，又怨〖◆汉〗护〖@呼韩邪〗而不助己，乃遣使求侍子"),
]
R += [
    (279, "汉议欲遣送之。司农郎中候应上言，以为郅支单于乡化未醇，所在绝远，宜令使者送其子而还", "〖◆汉〗议欲遣送之。司农郎中候应上言，以为〖@郅支〗〖;单于〗乡化未醇，所在绝远，宜令使者送其子而还"),
    (279, "上乃止。后竟遣送，因令使者验之，郅支遂杀汉使者，乃西走康居", "〖#上〗乃止。后竟遣送，因令使者验之，〖@郅支〗遂⟦◎杀〗〖◆汉〗使者，乃西走〖=康居〗"),
    (279, "康居王以女妻郅支，郅支亦以女予康居王，相为倚重", "〖=康居〗王以女妻〖@郅支〗，〖@郅支〗亦以女予〖=康居〗王，相为倚重"),
]
R += [
    (281, "郅支数借兵击乌孙，破之。乌孙、西域诸国皆畏匈奴", "〖@郅支〗数借兵⟦◎击〗〖◆乌孙〗，⟦◎破〗之。〖◆乌孙〗、西域诸国皆畏〖◆匈奴〗"),
    (281, "汉遣使求其侍子，郅支不与，又上书言：“愿入附汉，且遣子入侍”", "〖◆汉〗遣使求其侍子，〖@郅支〗不与，又上书言：“愿入附〖◆汉〗，且遣子入侍”"),
    (281, "汉欲令西域诸国共击之，会康居亦数召郅支，郅支遂往居之", "〖◆汉〗欲令西域诸国共击之，会〖=康居〗亦数召〖@郅支〗，〖@郅支〗遂往居之"),
]
R += [
    (283, "建昭三年，汉使西域都护甘延寿、副校尉陈汤发西域诸国兵，至康居，攻郅支城", "建昭三年，〖◆汉〗使西域都护〖@甘延寿〗、〖;副校尉〗〖@陈汤〗发西域诸国兵，至〖=康居〗，⟦◈攻〗〖=郅支城〗"),
    (283, "斩郅支首及阏氏、太子、名王以下千五百余级，生卤百四十五人，降虏千余人，以赐城郭诸国所发十五王", "⟦◎斩〗〖@郅支〗首及〖;阏氏〗、〖#太子〗、名王以下千五百余级，生卤百四十五人，⟦◎降〗虏千余人，以赐城郭诸国所发十五王"),
    (283, "甘延寿、陈汤上疏，言“郅支单于囚杀使者，暴虐无道，故兴师远伐，以诛不义”", "〖@甘延寿〗、〖@陈汤〗上疏，言“〖@郅支〗〖;单于〗囚杀使者，暴虐无道，故兴师远伐，以诛不义”"),
]
R += [
    (285, "既而竟不劳师，得单于首。是岁，竟宁元年也", "既而竟不劳师，得〖;单于〗首。是岁，竟宁元年也"),
    (285, "后呼韩邪单于复入朝，自言愿婿汉氏以自亲。元帝以后宫良家子王嫱字昭君赐单于", "后〖@呼韩邪〗〖;单于〗复入朝，自言愿婿汉氏以自亲。〖@元帝|汉元帝〗以后宫良家子王嫱字〖@昭君〗赐〖;单于〗"),
    (285, "单于甚喜，上书愿保塞上谷以西至敦煌，请罢边备，以休天子人民", "〖;单于〗甚喜，上书愿保塞〖=上谷〗以西至〖=敦煌〗，请罢边备，以休〖#天子〗人民"),
]
R += [
    (287, "郎中候应习边事，以为不可许。上问状，应曰：“周秦以来，匈奴暴桀，寇侵边境”，", "郎中候应习边事，以为不可许。〖#上〗问状，〖@候应〗曰：“周秦以来，〖◆匈奴〗暴桀，寇侵边境”，"),
    (287, "“今罢边备，开塞下市易，恐其变生肘腋”", "“今罢边备，开塞下市易，恐其变生肘腋”"),
    (287, "上乃止。明年，呼韩邪死，子复株累若鞮单于立，复妻王昭君", "〖#上〗乃止。明年，〖@呼韩邪〗死，子〖@复株累若鞮〗〖;单于〗立，复妻〖@王昭君|王昭君〗"),
]
R += [
    (289, "自呼韩邪死，匈奴内乱，五单于争立，汉皆不能制。后郅支既死，匈奴遂弱", "自〖@呼韩邪〗死，〖◆匈奴〗内乱，五单于争立，〖◆汉〗皆不能制。后〖@郅支〗既死，〖◆匈奴〗遂弱"),
    (289, "汉竟宁以来，单于保塞称藩，边垂无事者数十年", "〖◆汉〗竟宁以来，〖;单于〗保塞称藩，边垂无事者数十年"),
]
