# -*- coding: utf-8 -*-
# 卷089 循吏传 [1.51]-[1.55]：召信臣
R = [
(105, "召信臣字翁卿", "〖@召信臣〗字〖@翁卿〗"),
(105, "九江寿春人也", "〖=九江〗〖=寿春〗人也"),
(105, "以明经甲科为郎", "以〖#明经〗〖^甲科〗为〖;郎〗"),
(105, "出补穀阳长", "出补〖;穀阳长〗"),
(105, "举高第", "举〖#高第〗"),
(105, "迁上蔡长", "⟦○迁⟧〖;上蔡长〗"),
(105, "超为零陵太守", "超为〖;零陵太守〗"),
(105, "复征为谏大夫", "复⟦○征⟧为〖;谏大夫〗"),
(105, "迁南阳太守", "⟦○迁⟧〖;南阳太守〗"),
(105, "信臣为人勤力有方略", "〖@信臣|召信臣〗为人勤力有方略"),

(107, "多至三万顷", "多至〖$三万顷〗"),
(107, "信臣为民作均水约束", "〖@信臣|召信臣〗为民作均水约束"),

(109, "辄斥罢之", "辄斥⟦○罢⟧之"),
(109, "吏民亲爱信臣", "吏民亲爱〖@信臣|召信臣〗"),
(109, "号之曰召父", "号之曰〖@召父|召信臣〗"),
(109, "荆州刺史奏信臣", "〖;荆州刺史〗奏〖@信臣|召信臣〗"),
(109, "赐黄金四十斤", "⟦○赐⟧黄金〖$四十斤〗"),

(111, "迁河南太守", "⟦○迁⟧〖;河南太守〗"),
(111, "复数增秩赐金", "复数增秩⟦○赐⟧金"),
(111, "竟宁中", "〖%竟宁中〗"),
(111, "征为少府", "⟦○征⟧为〖;少府〗"),
(111, "列于九卿", "列于〖;九卿〗"),
(111, "奏请上林诸离远宫馆", "奏请〖=上林〗诸离远宫馆"),
(111, "又奏省乐府黄门倡优诸戏", "又奏省〖;乐府〗〖;黄门〗倡优诸戏"),
(111, "太官园种冬生葱韭菜茹", "〖;太官〗园种冬生葱韭菜茹"),

(113, "信臣以为此皆不时之物", "〖@信臣|召信臣〗以为此皆不时之物"),
(113, "悉奏罢", "悉奏⟦○罢⟧"),
(113, "省费岁数千万", "省费岁〖$数千万〗"),
(113, "信臣年老以官卒", "〖@信臣|召信臣〗年老以官卒"),
(113, "元始四年", "〖%元始四年〗"),
(113, "诏书祀百辟卿士有益于民者", "〖•诏书〗祀〖#百辟卿士〗有益于民者"),
(113, "蜀郡以文翁", "〖=蜀郡〗以〖@文翁〗"),
(113, "九江以召父应诏书", "〖=九江〗以〖@召父|召信臣〗应〖•诏书〗"),
(113, "岁时郡二千石率官属行礼", "岁时〖;郡二千石〗率官属行礼"),
(113, "奉祠信臣冢", "奉祠〖@信臣|召信臣〗冢"),
(113, "而南阳亦为立祠", "而〖=南阳〗亦为立祠"),
]
